---

C#Visual BasicVisual C++

Revit 2024 API
---
TabbedDialogExtension..::..OnRestoreDefaultsAction Property
TabbedDialogExtension Class See Also Send Feedback
---

The restore defaults handler.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013

# Syntax

C#
---

    public TabbedDialogAction OnRestoreDefaultsAction { get; set; }

Visual Basic
---

    Public Property OnRestoreDefaultsAction As TabbedDialogAction
    	Get
    	Set

Visual C++
---

    public:
    property TabbedDialogAction^ OnRestoreDefaultsAction {
    	TabbedDialogAction^ get ();
    	void set (TabbedDialogAction^ value);
    }

# Remarks

This handler will be invoked when the "Restore Defaults" button in Revit options dialog is clicked and the handler should apply only to options set on this page. There is no "Restore Defaults" button in Revit options dialog if this property was set to nullNothingnullptra null reference (Nothing in Visual Basic).

# See Also

TabbedDialogExtension Class

Autodesk.Revit.UI Namespace